resources/testData.json

{
    "payments": {
        "insertTestPayment": {
            "title": "test payment",
            "description": "test description",
            "amount": "20",
            "initialPaymentAmount": "23",
            "currency": "PMA",
            "numberOfPayments": 5,
            "frequency": 3,
            "typeID": 1,
            "networkID": 3
        },
        "updateTestPayment": {
            "id": "",
            "title": "changes title",
            "description": "another description",
            "promo": "testing",
            "amount": "20",
            "initialPaymentAmount": "23",
            "currency": "CVC",
            "numberOfPayments": 5,
            "typeID": 2,
            "frequency": 3,
            "networkID": 3
        }
    },
    "contracts": {
        "insertTestContract": {
            "hdWalletIndex": 0,
            "paymentID": "needed to be injected",
            "numberOfPayments": 4,
            "nextPaymentDate": 10,
            "lastPaymentDate": 20,
            "startTimestamp": 100,
            "customerAddress": "243423",
            "pullPaymentAddress": "24234234",
            "statusID": 1,
            "userID": "2342934"
        },
        "updateTestContract": {
            "id": "",
            "hdWalletIndex": 0,
            "numberOfPayments": 5,
            "nextPaymentDate": 10,
            "lastPaymentDate": 20,
            "startTimestamp": 100,
            "statusID": 1,
            "userID": "2342934"
        }
    }
}